# pandas tutorial

In [41]:
import numpy as np
import pandas as pd

In [42]:
from ipywidgets import widgets
from IPython.display import Javascript, display

align_kw = dict(
    _css = (('.widget-label', 'min-width', '20ex'),),
    margin = '0px 0px 5px 12px'
)
platform_ui = widgets.Dropdown(description = 'platform',options=['iPhone','iPad','Android'], **align_kw)
event_type_ui = widgets.Text(value='open', description='Test Event', **align_kw)
os_version_ui = widgets.Text(value='iOS9', description='Operating System', **align_kw)
refresh_ui = widgets.Checkbox(description='Force Refresh', **align_kw)

display(platform_ui,event_type_ui,os_version_ui,refresh_ui)

Dropdown(description='platform', options=('iPhone', 'iPad', 'Android'), value='iPhone')

Text(value='open', description='Test Event')

Text(value='iOS9', description='Operating System')

Checkbox(value=False, description='Force Refresh')

In [15]:
my_se = pd.Series([1,2,3],index=['coloumn1','coloumn2','coloumn3'])

In [16]:
my_se

coloumn1    1
coloumn2    2
coloumn3    3
dtype: int64

In [17]:
# show the values
my_se.values

array([1, 2, 3], dtype=int64)

In [18]:
# show the index
my_se.index

Index(['coloumn1', 'coloumn2', 'coloumn3'], dtype='object')

In [19]:
my_se.coloumn1

1

In [20]:
my_se['coloumn1']

1

In [21]:
my_se[my_se>=2]

coloumn2    2
coloumn3    3
dtype: int64

In [22]:
# Change the index name
my_se.rename({'coloumn1':'a', 'coloumn2':'b', 'coloumn3':'c'})

a    1
b    2
c    3
dtype: int64

In [23]:
arr = np.array([[2,4,5,6],['s','f','g','h'],[2,3,7,4],[8,5,2,4]])

In [24]:
td = pd.DataFrame(arr,index=['value1','value2','value3','value4'],columns=['col1','col2','col3','col4'])

In [25]:
td

       col1 col2 col3 col4
value1    2    4    5    6
value2    s    f    g    h
value3    2    3    7    4
value4    8    5    2    4

In [27]:
# index
td.index

Index(['value1', 'value2', 'value3', 'value4'], dtype='object')

In [28]:
# columns
td.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [30]:
# Values
td.values

array([['2', '4', '5', '6'],
       ['s', 'f', 'g', 'h'],
       ['2', '3', '7', '4'],
       ['8', '5', '2', '4']], dtype=object)

### loc and Iloc

In [32]:
# If I want to rich to spesific value in data fram i can use one of them
td.loc['value1','col1']

'2'

In [33]:
# iloc
td.iloc[0,0]

'2'

### Add new Column

In [34]:
td['col5']=['hasib','basira','Nasrin',"qasim"]

In [35]:
td

       col1 col2 col3 col4    col5
value1    2    4    5    6   hasib
value2    s    f    g    h  basira
value3    2    3    7    4  Nasrin
value4    8    5    2    4   qasim

In [37]:
# Nothing
td.loc[['value1','value2'],['col1']]=0

In [38]:
td

       col1 col2 col3 col4    col5
value1    0    4    5    6   hasib
value2    0    f    g    h  basira
value3    2    3    7    4  Nasrin
value4    8    5    2    4   qasim

### Resat Index

In [39]:
td.reset_index(drop=True,inplace=True)

In [40]:
td

  col1 col2 col3 col4    col5
0    0    4    5    6   hasib
1    0    f    g    h  basira
2    2    3    7    4  Nasrin
3    8    5    2    4   qasim

### Drop Columns

In [44]:
td.drop('col5',axis=1,inplace=True)

In [45]:
td

  col1 col2 col3 col4
0    0    4    5    6
1    0    f    g    h
2    2    3    7    4
3    8    5    2    4

### Rename columns

In [46]:
td.rename(columns={'col4':'c4'},inplace=True)

In [47]:
td

  col1 col2 col3 c4
0    0    4    5  6
1    0    f    g  h
2    2    3    7  4
3    8    5    2  4

### Replace values

In [48]:
td.replace(0,1)

  col1 col2 col3 c4
0    1    4    5  6
1    1    f    g  h
2    2    3    7  4
3    8    5    2  4